cask_args appdir: '/Applications'

brew 'awscli'
brew 'bash-completion'
brew 'blackbox'
brew 'bower'
brew 'chruby'
brew 'git'
brew 'gnupg'
brew 'grunt'
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'jsonpp'
brew 'jq'
brew 'mongodb'
brew 'neovim'
brew 'pass'
brew 'postgres'
brew 'pv'
brew 'redis'
brew 'ruby-install'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tmux'
brew 'yarn'

cask 'TextMate'
cask 'gpg-suite'
cask 'iterm2'
cask 'java'
cask 'qlcolorcode'    # https://github.com/sindresorhus/quick-look-plugins#qlcolorcode
cask 'qlmarkdown'     # https://github.com/sindresorhus/quick-look-plugins#qlmarkdown
cask 'qlstephen'      # https://github.com/sindresorhus/quick-look-plugins#qlstephen
cask 'quicklook-json' # https://github.com/sindresorhus/quick-look-plugins#quicklookjson
cask 'vagrant'
cask 'virtualbox'
cask 'webpquicklook'  # https://github.com/sindresorhus/quick-look-plugins#webp

tap 'cloudfoundry/tap'
brew 'cloudfoundry/tap/cf-cli'

tap 'heroku/brew'
brew 'heroku/brew/heroku'
